# 6.	Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
a = int(input('Введите номер буквы  '))
char = chr(a + 96)
print(f'Буква - {char}')
      